package gr.aueb.softeng.project1806.dao;

import java.util.List;

import gr.aueb.softeng.project1806.model.Leg;

/** Η διεπαφή DAO για την κλάση {@link Leg}.
 */
public interface LegDAO {
    /**
     * Αποθηκεύει ένα αντικείμενο στην πηγή
     * δεδομένων. Το αντικείμενο μπορεί να είναι κάποιο
     * νέο αντικείμενο που δεν υπάρχει στην πηγή δεδομένων
     * ή κάποιο το οποίο ήδη υπάρχει και ενημερώνεται η
     * κατάστασή του.
     * @param leg Το αντικείμενο του οποίου η κατάσταση
     * αποθηκεύεται στην πηγή δεδομένων.
     */
    void add(Leg leg);

    /**
     * Διαγράφει το αντικείμενο από την πηγή δεδομένων.
     * @param leg Το αντικείμενο προς διαγραφή.
     */
    void remove(Leg leg);

    /**
     * Επιστρέφει όλα τα αντικείμενα  από την πηγή δεδομένων.
     * @return Ο κατάλογος των αντικειμένων
     */
    List<Leg> findAll();
}
